post/Programing/C_language/C_language_note.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<meta name="author" content="不要在意我的头像QwQ" />
<meta name="description" content="自己尝试写的C语言教程（未完成）" />
<meta name="generator" content="Org Mode (third party program by python)" />
<title>C语言笔记</title>
<link rel="stylesheet" type="text/css" href="/theme/main.css"/>
<link rel="shortcut icon" href="/img/icon.jpg"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="#"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div>
<div id="content" class="content">
<h1 class="title">C语言笔记</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul><li><a href="#org-title-1">1. 配置开发环境</a><ul><li><a href="#org-title-1-1">1.1. Windows</a></li><li><a href="#org-title-1-2">1.2. Linux</a></li></ul></li>
<li><a href="#org-title-2">2. 正式学习前的准备</a><ul><li><a href="#org-title-2-1">2.1. 第一个C语言程序</a></li><li><a href="#org-title-2-2">2.2. 算法</a></li></ul></li>
<li><a href="#org-title-3">3. 基本语法</a><ul><li><a href="#org-title-3-1">3.1. 关键字</a></li><li><a href="#org-title-3-2">3.2. 变量</a><ul><li><a href="#org-title-3-2-1">3.2.1. 变量的定义与声明</a></li><li><a href="#org-title-3-2-2">3.2.2. 变量的一些修饰词</a></li><li><a href="#org-title-3-2-3">3.2.3. 整型</a></li><li><a href="#org-title-3-2-4">3.2.4. 浮点型</a></li><li><a href="#org-title-3-2-5">3.2.5. 字符型</a></li><li><a href="#org-title-3-2-6">3.2.6. 数组</a></li><li><a href="#org-title-3-2-7">3.2.7. 指针</a></li><li><a href="#org-title-3-2-8">3.2.8. 结构体</a></li></ul></li>
<li><a href="#org-title-3-3">3.3. 输入与输出</a><ul><li><a href="#org-title-3-3-1">3.3.1. 输出</a></li><li><a href="#org-title-3-3-2">3.3.2. 输入</a></li></ul></li>
<li><a href="#org-title-3-4">3.4. 函数</a><ul><li><a href="#org-title-3-4-1">3.4.1. 函数的定义与声明</a></li><li><a href="#org-title-3-4-2">3.4.2. 函数的调用</a></li><li><a href="#org-title-3-4-3">3.4.3. 函数指针</a></li><li><a href="#org-title-3-4-4">3.4.4. 更多功能函数</a></li></ul></li>
<li><a href="#org-title-3-5">3.5. 文件</a><ul><li><a href="#org-title-3-5-1">3.5.1. 文件的打开与关闭</a></li><li><a href="#org-title-3-5-2">3.5.2. 读取与写入</a></li><li><a href="#org-title-3-5-3">3.5.3. 位置控制</a></li></ul></li>
<li><a href="#org-title-3-6">3.6. 内存管理</a><ul><li><a href="#org-title-3-6-1">3.6.1. 内存的基本概念</a></li><li><a href="#org-title-3-6-2">3.6.2. 内存的申请</a></li><li><a href="#org-title-3-6-3">3.6.3. 内存的释放</a></li></ul></li></ul></li></ul></div></div>
<div class="outline-2">
<h2 id="org-title-1"><span class="section-number-2">1.</span> 配置开发环境</h2>
<div class="outline-text-2" id="text-1"><p>C语言是一门古老的语言，用它编写的程序要使用编译器编译后才能够执行。所以我们需要做的事情就应该是：配置开发环境。要运行C语言程序，我们需要一个编译器。而且不只是需要编译器，我们还需要一个编辑器。基于不同系统的情况，配置开发环境的内容将会分为几段内容。</p></div><div class="outline-3">
<h3 id="org-title-1-1"><span class="section-number-3">1.1.</span> Windows</h3>
<div class="outline-text-3" id="text-1-1"><p>在Windows下，重量级的开发环境有
<a href="https://visualstudio.microsoft.com/zh-hans/#vs-section">Visual Studio</a> 系列中的Visual Studio 2022，而其中的 Visual Studio code则相对轻量，体积较小。我个人推荐使用VScode作为编辑器，毕竟如果 使用Visual Studio 2022作为IDE的话，安装太慢了（而且我也不会用）。而VScode作为一 个编辑器已经是足够了的。</p><p>编译器我推荐使用GCC，而Windows平台的GCC就是
<a href="https://sourceforge.net/projects/mingwbuilds/">mingw</a>。安装教程建议看看
<a href="https://zhuanlan.zhihu.com/p/76613134">这篇文章</a>。</p><p>注意：下载链接为我给出的mingw链接，mingw的官网样式有修改，链接有点难找。</p></div></div><div class="outline-3">
<h3 id="org-title-1-2"><span class="section-number-3">1.2.</span> Linux</h3>
<div class="outline-text-3" id="text-1-2"><blockquote>
<p>在Linux下的开发效率理论上是要比windows高的，但是也没有必要为了开发直接装Linux，新手盲入坑会多到数不过来。建议使用虚拟机，Linux发行版新手建议使用Ubuntu，好上手</p></blockquote><p>相较于Windows平台下，Linux下的配置就简单多了。大多数Linux发行版的包管理器都提供 GCC的安装。以Debian及其衍生发行版和Arch为例：</p><div class="org-src-container"><pre class="src src-shell"><span class="c1"># Debian:</span>
sudo<span class="w"> </span>apt<span class="w"> </span>install<span class="w"> </span>gcc
</pre></div><div class="org-src-container"><pre class="src src-shell"><span class="c1"># Arch:</span>
sudo<span class="w"> </span>pacman<span class="w"> </span>-S<span class="w"> </span>gcc
</pre></div><p>在安装了GCC后，可以使用 <code>gcc 输入文件.c -o 输出文件</code> 为格式运行gcc（Windows下的命令格式相同）</p><p><code>gcc --help</code> 命令结果：</p><details>
  <summary>GCC帮助文档</summary>
<div class="org-src-container"><pre class="src src-text">用法：gcc [选项] 文件...
选项：
  -pass-exit-codes         在某一阶段退出时返回其中最高的错误码。
  --help                   显示此帮助说明。
  --target-help            Display target specific command line options (including assembler and linker options).
  --help={common|optimizers|params|target|warnings|[^]{joined|separate|undocumented}}[,...]。
                           显示特定类型的命令行选项。
 （使用‘-v --help’显示子进程的命令行参数）。
  --version                显示编译器版本信息。
  -dumpspecs               显示所有内建 spec 字符串。
  -dumpversion             显示编译器的版本号。
  -dumpmachine             显示编译器的目标处理器。
  -foffload=&lt;targets&gt;      Specify offloading targets.
  -print-search-dirs       显示编译器的搜索路径。
  -print-libgcc-file-name  显示编译器伴随库的名称。
  -print-file-name=&lt;库&gt;    显示 &lt;库&gt; 的完整路径。
  -print-prog-name=&lt;程序&gt;  显示编译器组件 &lt;程序&gt; 的完整路径。
  -print-multiarch         显示目标的标准 GNU 三元组（被用于库路径的一部分）。
  -print-multi-directory   显示不同版本 libgcc 的根目录。
  -print-multi-lib         显示命令行选项和多个版本库搜索路径间的映射。
  -print-multi-os-directory 显示操作系统库的相对路径。
  -print-sysroot           显示目标库目录。
  -print-sysroot-headers-suffix 显示用于寻找头文件的 sysroot 后缀。
  -Wa,&lt;选项&gt;               将逗号分隔的 &lt;选项&gt; 传递给汇编器。
  -Wp,&lt;选项&gt;               将逗号分隔的 &lt;选项&gt; 传递给预处理器。
  -Wl,&lt;选项&gt;               将逗号分隔的 &lt;选项&gt; 传递给链接器。
  -Xassembler &lt;参数&gt;       将 &lt;参数&gt; 传递给汇编器。
  -Xpreprocessor &lt;参数&gt;    将 &lt;参数&gt; 传递给预处理器。
  -Xlinker &lt;参数&gt;          将 &lt;参数&gt; 传递给链接器。
  -save-temps              不删除中间文件。
  -save-temps=&lt;参数&gt;       不删除中间文件。
  -no-canonical-prefixes   生成其他 gcc 组件的相对路径时不生成规范化的
                           前缀。
  -pipe                    使用管道代替临时文件。
  -time                    为每个子进程计时。
  -specs=&lt;文件&gt;            用 &lt;文件&gt; 的内容覆盖内建的 specs 文件。
  -std=&lt;标准&gt;              假定输入源文件遵循给定的标准。
  --sysroot=&lt;目录&gt;         将 &lt;目录&gt; 作为头文件和库文件的根目录。
  -B &lt;目录&gt;                将 &lt;目录&gt; 添加到编译器的搜索路径中。
  -v                       显示编译器调用的程序。
  -###                     与 -v 类似，但选项被引号括住，并且不执行命令。
  -E                       仅作预处理，不进行编译、汇编或链接。
  -S                       编译到汇编语言，不进行汇编和链接，
  -c                       编译、汇编到目标代码，不进行链接。
  -o &lt;文件&gt;                输出到 &lt;文件&gt;。
  -pie                     生成动态链接的位置无关可执行文件。
  -shared                  生成一个共享库。
  -x &lt;语言&gt;                指定其后输入文件的语言。
                           允许的语言包括：c、c++、assembler、none
                           ‘none’意味着恢复默认行为，即根据文件的扩展名猜测
                           源文件的语言。

以 -g、-f、-m、-O、-W 或 --param 开头的选项将由 gcc 自动传递给其调用的
 不同子进程。若要向这些进程传递其他选项，必须使用 -W&lt;字母&gt; 选项。

报告程序缺陷的步骤请参见：
&lt;https://bugs.archlinux.org/&gt;.
</pre></div></details>
<p>除了编译器，我们还需要一个编辑器。这里我推荐使用VScode，因为它拥有非常强大的自动补全系统，并且支持Linux。</p><p>Debian系的用户可以使用官网提供的deb包安装。下载页面链接如上面windows部分的链接相同，请自行回去找。</p><p>而Arch的用户则需要使用AUR的 <code>visual-studio-code-bin</code> 包，使用一个AUR管理器下载安装。</p></div></div></div><div class="outline-2">
<h2 id="org-title-2"><span class="section-number-2">2.</span> 正式学习前的准备</h2>
<div class="outline-3">
<h3 id="org-title-2-1"><span class="section-number-3">2.1.</span> 第一个C语言程序</h3>
<div class="outline-text-3" id="text-2-1"><p>作为示范程序，自然就却不了编程界中的名梗 <code>Hello World</code> 。即编写程序打印"HelloWorld"。<br/> 示例代码如下：</p><div class="org-src-container"><pre class="src src-c"><span class="cm">/**</span>
<span class="cm">* @FileName:Example.c</span>
<span class="cm">* @Author:Chglish</span>
<span class="cm">* @Description:这里是多行注释</span>
<span class="cm">*/</span>

<span class="cm">/* 引入头文件 */</span>
<span class="cp">#include</span><span class="w"> </span><span class="cpf">&lt;stdio.h&gt;</span>

<span class="cm">/* 函数定义 */</span>
<span class="kt">int</span><span class="w"> </span><span class="nf">main</span><span class="p">(</span><span class="kt">int</span><span class="w"> </span><span class="n">argc</span><span class="p">,</span><span class="w"> </span><span class="kt">char</span><span class="w"> </span><span class="o">*</span><span class="n">argv</span><span class="p">[])</span>
<span class="p">{</span>
<span class="w">        </span><span class="n">printf</span><span class="p">(</span><span class="s">&quot;Hello World</span><span class="se">\n</span><span class="s">&quot;</span><span class="p">);</span><span class="w">    </span><span class="c1">// 打印 Hello World</span>
<span class="w">        </span><span class="k">return</span><span class="w"> </span><span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</pre></div><p>在这个粒子中，我们能够接触到一些C语言的基本要素，我们一个个分析</p><ul class="org-ul">
<li>注释在源代码中被 <code>/**/</code> 包裹和一行内 <code>//</code> 以右的内容均为注释（代码高亮为灰色）。在编程中，由于可能要面临与他人沟通的情况，所以需要在代码内添加注释作为解释内容方便理解。在编译过程中，编译器会忽略掉全部的注释信息，因此也可以将一行代码注释掉代替删除该行代码。C语言中，注释又有两种，一种即为将一部分区间注释掉的 <code>/**/</code> 注释，另一种即为将一行中往右注释掉的 <code>//</code> 注释。
<div class="org-src-container"><pre class="src src-c"><span class="cm">/* 这种区间注释可以在一行内使用 */</span>

<span class="cm">/*</span>
<span class="cm">* 也可以像这样子多行注释</span>
<span class="cm">*/</span>

<span class="c1">// 而单行注释只有在注释符以右的位置有用</span>

<span class="cm">/*</span>
<span class="cm">   // 两种注释可以嵌套使用</span>
<span class="cm">*/</span>

<span class="cm">/*  /* 但是这种注释不能够嵌套使用，否则就像右边的收注释符，并不属于注释的范围内 */</span><span class="w">  </span><span class="o">*/</span>
</pre></div>
</li>
<li>引入头文件代码中的 <code>#include</code> 属于C语言中的 <code>预处理</code> ，其效果等同于将其后方跟着的文件内容复制粘贴进入到当前文件，类似于嵌套文件。 <code>#include</code> 也并不只有一种，而是有两种，举个例子：
<div class="org-src-container"><pre class="src src-c"><span class="cp">#include</span><span class="w"> </span><span class="cpf">&lt;xxx.h&gt;</span>
<span class="cp">#include</span><span class="w"> </span><span class="cpf">&quot;xxx.h&quot;</span>
</pre></div>
<p>上面的两行都是符合要求的例子，使用 <code>&lt;&gt;</code> 和使用 <code>""</code> 的区别在于，使用 <code>&lt;&gt;</code> 时，编译器只会在（默认）指定的目录下寻找文件，而 <code>""</code> 则会让编译器搜寻本地目录的文件，用于引入自己编辑的头文件，如果找不到，再去指定目录搜寻。被括起来的 <code>xxx.h</code> 即为文件名，而 <code>.h</code> 就是C语言头文件的后缀名。</p>
</li>
<li>main函数执行程序一定得有开头，而在C语言里，这个开头就是main函数。约等于是程序的功能是从main函数内开始一步步执行。对新手来说，只需要做到将程序语句放置在main函数的花括号 <code>{}</code> 内部， <code>return</code> 语句前即可
</li>
<li>输出倘若我们想在我们的程序输出一些内容该怎么办呢？ <code>printf</code> ，stdio.h里的函数，是C 语言中最基础的输出方式。在 <code>printf("xxx")</code> 中，它会将引号中的 <code>xxx</code> 打印出来到终端，实现最基础的输出功能
</li>
<li>返回在函数的最后有一个返回语句 <code>return</code> 。可以这样理解，一个程序是要有始有终的，而这个“终”就相当于是给出了计算的结果。虽然在程序中，我们通过 <code>printf</code> 实现了输出，但实际上计算机是不知道结果的。所以我们需要 <code>return</code> 语句，以退出函数并给出一个结果值，而这个结果值由函数名称前的类型决定（我们暂且按下不表）。
</li></ul>
<p>可见，一个普通的C语言程序可以由几部分构成：注释，引入头文件，main函数（必须），及其他部分。</p></div></div><div class="outline-3">
<h3 id="org-title-2-2"><span class="section-number-3">2.2.</span> 算法</h3>
</div></div><div class="outline-2">
<h2 id="org-title-3"><span class="section-number-2">3.</span> 基本语法</h2>
<div class="outline-text-2" id="text-3"><blockquote>
<p>注：由于C语言的知识体系是一个有机整体，而基于作者文学水平，以下内容以分类作编排，所以可能需要反复跳转查阅，请见谅</p></blockquote></div><div class="outline-3">
<h3 id="org-title-3-1"><span class="section-number-3">3.1.</span> 关键字</h3>
<div class="outline-text-3" id="text-3-1"><p>在C语言内，有预留有一部分的单词作为关键词，用于在编译时将C语言代码转为机器能够理解的二进制代码，下面便是一个表格，其中列出了大部分的C语言关键字，并列出了他们功能的简易介绍。</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">名称</th><th scope="col" class="org-left">作用</th></tr>
</thead><tbody>
<tr><td class="org-left"><code>if</code></td><td class="org-left">如果，判断</td></tr><tr><td class="org-left"><code>else</code></td><td class="org-left">（接上）就，判断</td></tr><tr><td class="org-left"><code>while</code></td><td class="org-left">循环</td></tr><tr><td class="org-left"><code>for</code></td><td class="org-left">循环</td></tr></table></div></div><div class="outline-3">
<h3 id="org-title-3-2"><span class="section-number-3">3.2.</span> 变量</h3>
<div class="outline-4">
<h4 id="org-title-3-2-1"><span class="section-number-4">3.2.1.</span> 变量的定义与声明</h4>
</div><div class="outline-4">
<h4 id="org-title-3-2-2"><span class="section-number-4">3.2.2.</span> 变量的一些修饰词</h4>
<div class="outline-5">
<p id="org-title-3-2-2-1"><b><span class="section-number-5">3.2.2.1.</span> 常量</b></p>
</div><div class="outline-5">
<p id="org-title-3-2-2-2"><b><span class="section-number-5">3.2.2.2.</span> 修饰词之间位置的关系</b></p>
</div></div><div class="outline-4">
<h4 id="org-title-3-2-3"><span class="section-number-4">3.2.3.</span> 整型</h4>
</div><div class="outline-4">
<h4 id="org-title-3-2-4"><span class="section-number-4">3.2.4.</span> 浮点型</h4>
</div><div class="outline-4">
<h4 id="org-title-3-2-5"><span class="section-number-4">3.2.5.</span> 字符型</h4>
</div><div class="outline-4">
<h4 id="org-title-3-2-6"><span class="section-number-4">3.2.6.</span> 数组</h4>
</div><div class="outline-4">
<h4 id="org-title-3-2-7"><span class="section-number-4">3.2.7.</span> 指针</h4>
</div><div class="outline-4">
<h4 id="org-title-3-2-8"><span class="section-number-4">3.2.8.</span> 结构体</h4>
<div class="outline-5">
<p id="org-title-3-2-8-1"><b><span class="section-number-5">3.2.8.1.</span> 链表</b></p>
</div></div></div><div class="outline-3">
<h3 id="org-title-3-3"><span class="section-number-3">3.3.</span> 输入与输出</h3>
<div class="outline-4">
<h4 id="org-title-3-3-1"><span class="section-number-4">3.3.1.</span> 输出</h4>
<div class="outline-5">
<p id="org-title-3-3-1-1"><b><span class="section-number-5">3.3.1.1.</span> printf</b></p>
</div><div class="outline-5">
<p id="org-title-3-3-1-2"><b><span class="section-number-5">3.3.1.2.</span> puts</b></p>
</div><div class="outline-5">
<p id="org-title-3-3-1-3"><b><span class="section-number-5">3.3.1.3.</span> putc</b></p>
</div></div><div class="outline-4">
<h4 id="org-title-3-3-2"><span class="section-number-4">3.3.2.</span> 输入</h4>
<div class="outline-5">
<p id="org-title-3-3-2-1"><b><span class="section-number-5">3.3.2.1.</span> scanf</b></p>
</div><div class="outline-5">
<p id="org-title-3-3-2-2"><b><span class="section-number-5">3.3.2.2.</span> getc</b></p>
</div><div class="outline-5">
<p id="org-title-3-3-2-3"><b><span class="section-number-5">3.3.2.3.</span> getchar</b></p>
</div></div></div><div class="outline-3">
<h3 id="org-title-3-4"><span class="section-number-3">3.4.</span> 函数</h3>
<div class="outline-4">
<h4 id="org-title-3-4-1"><span class="section-number-4">3.4.1.</span> 函数的定义与声明</h4>
</div><div class="outline-4">
<h4 id="org-title-3-4-2"><span class="section-number-4">3.4.2.</span> 函数的调用</h4>
</div><div class="outline-4">
<h4 id="org-title-3-4-3"><span class="section-number-4">3.4.3.</span> 函数指针</h4>
</div><div class="outline-4">
<h4 id="org-title-3-4-4"><span class="section-number-4">3.4.4.</span> 更多功能函数</h4>
<div class="outline-5">
<p id="org-title-3-4-4-1"><b><span class="section-number-5">3.4.4.1.</span> 字符串处理</b></p>
</div><div class="outline-5">
<p id="org-title-3-4-4-2"><b><span class="section-number-5">3.4.4.2.</span> Socket套接字</b></p>
</div><div class="outline-5">
<p id="org-title-3-4-4-3"><b><span class="section-number-5">3.4.4.3.</span> Ncurses打印</b></p>
</div></div></div><div class="outline-3">
<h3 id="org-title-3-5"><span class="section-number-3">3.5.</span> 文件</h3>
<div class="outline-4">
<h4 id="org-title-3-5-1"><span class="section-number-4">3.5.1.</span> 文件的打开与关闭</h4>
</div><div class="outline-4">
<h4 id="org-title-3-5-2"><span class="section-number-4">3.5.2.</span> 读取与写入</h4>
<div class="outline-5">
<p id="org-title-3-5-2-1"><b><span class="section-number-5">3.5.2.1.</span> 读取</b></p>
<div class="outline-6">
<p id="org-title-3-5-2-1-1"><b><span class="section-number-6">3.5.2.1.1.</span> fscanf</b></p>
</div><div class="outline-6">
<p id="org-title-3-5-2-1-2"><b><span class="section-number-6">3.5.2.1.2.</span> fgets</b></p>
</div><div class="outline-6">
<p id="org-title-3-5-2-1-3"><b><span class="section-number-6">3.5.2.1.3.</span> fgetc</b></p>
</div><div class="outline-6">
<p id="org-title-3-5-2-1-4"><b><span class="section-number-6">3.5.2.1.4.</span> fread</b></p>
</div></div><div class="outline-5">
<p id="org-title-3-5-2-2"><b><span class="section-number-5">3.5.2.2.</span> 写入</b></p>
<div class="outline-6">
<p id="org-title-3-5-2-2-1"><b><span class="section-number-6">3.5.2.2.1.</span> fprintf</b></p>
</div><div class="outline-6">
<p id="org-title-3-5-2-2-2"><b><span class="section-number-6">3.5.2.2.2.</span> fputs</b></p>
</div><div class="outline-6">
<p id="org-title-3-5-2-2-3"><b><span class="section-number-6">3.5.2.2.3.</span> fputc</b></p>
</div><div class="outline-6">
<p id="org-title-3-5-2-2-4"><b><span class="section-number-6">3.5.2.2.4.</span> fwrite</b></p>
</div></div></div><div class="outline-4">
<h4 id="org-title-3-5-3"><span class="section-number-4">3.5.3.</span> 位置控制</h4>
</div></div><div class="outline-3">
<h3 id="org-title-3-6"><span class="section-number-3">3.6.</span> 内存管理</h3>
<div class="outline-4">
<h4 id="org-title-3-6-1"><span class="section-number-4">3.6.1.</span> 内存的基本概念</h4>
</div><div class="outline-4">
<h4 id="org-title-3-6-2"><span class="section-number-4">3.6.2.</span> 内存的申请</h4>
</div><div class="outline-4">
<h4 id="org-title-3-6-3"><span class="section-number-4">3.6.3.</span> 内存的释放</h4>
</div></div></div></div>
<div id="postamble" class="status"><p class="date">时间: <2023-05-26 五 14:28></p>
<p class="author">作者: 不要在意我的头像QwQ</p>
<p class="description">描述: 自己尝试写的C语言教程（未完成）</p>
<p class="date">生成于: 2025-08-21 五 14:49:17</p>
</div>
</body>
</html>